# SharedCoords Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..SharedCoords Property
ACADExportOptions Class See Also
---
True to use the shared coordinate system's origin, false to use the project origin. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool SharedCoords { get; set; }
```

Visual Basic
---
```text
Public Property SharedCoords As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SharedCoords {
	bool get ();
	void set (bool value);
}
```

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace